    //Неразрушимые блоки координата X
var UnBreakableX=[
//Лаборатория
[5,5,5,3,3,3,3],[4,4,4,4,6,6,1,2,3,2,2,2,5],
//Поле боя
[],[2,4,6,4,5],[2,4,6,6,4,3,4],
//Шахта
[1,2,1,2],[4,3,5,1,2],[3,4,3,6,7,6,1,2],
//Пиратский корабль
[6,5,4,6,2,6,5],[4,6,2,6,2,7,7,1],[5,6,3,4,6,6,1,3,5,1,3,4,1,6],
//Пещеры гоблинов
[3,4,2,4,6,2,6,2,4,4,6,4],[2,6,4,3,4,2,7,2,4,4,6],[6,4,3,2,5,2,3,4,6],
//Огород
[],[5,3,7],[4,2,5,6,3,8,2,5,7],
//Пустыня
[1,1,1,2,1,1,2,1],[2,3,4,5,6,7,8,1,2,3,4,5,6,7,2,7,5,2,3,4,5,6,7,8],[4,7,1,2,5,6,1,2,5,4,8],
//Дом со скелетами
[2,8,2,8],[6,2,6,8,2,7,2,4,5,6,2,4,2,4,6,2,6,2,3,4,5,6,7,8,9],[4,2,4,6,8,2,6,7,2,4,5,6,2,4,1,2,4,6,7,8,9,2,6,2,3,4,6,8,9],
//Луна
[4,2,7,8,5,3,6,6,4,8,7,3],[4,2,7,8,5,3,6,1,6,4,1,6,3,5,4],
//Неизвестная планета
[3,1,4,5,9,7,3,5,8],[1,4,5,6,8,1,2,3,5,7,9,10,1,5,3,4,5,2,3,3,5,6,1,3,6,7,8]
];
    //Неразрушимые блоки координата Y
var UnBreakableY=[
//Лаборатория
[1,2,3,3,4,5,6],[1,3,4,5,2,6,6,6,4,4,3,2,4],
//Поле боя
[],[3,1,3,5,6],[2,2,1,3,5,6,7],
//Шахта
[3,3,5,5],[1,2,2,6,6],[2,3,4,4,5,6,6,6],
//Пиратский корабль
[1,2,4,4,5,5,6],[1,1,2,2,3,3,5,7],[1,1,2,3,3,4,5,5,5,6,6,6,7,7],
//Пещеры гоблинов
[2,2,3,3,3,4,4,5,5,6,6,7],[1,1,2,3,3,4,4,5,5,6,7],[1,2,3,4,4,5,6,6,7],
//Огород
[],[2,3,5],[1,2,2,2,3,3,4,4,5],
//Пустыня
[3,4,5,5,6,7,7,8],[2,2,2,2,2,2,2,4,4,4,4,4,4,4,5,5,6,7,7,7,7,7,7,7],[2,2,3,3,4,4,5,5,6,7,7],
//Дом со скелетами
[2,2,8,8],[1,2,2,2,3,3,4,4,4,4,5,5,6,6,6,7,7,8,8,8,8,8,8,8,9],[1,2,2,2,2,3,3,3,4,4,4,4,5,5,6,6,6,6,6,6,6,7,7,8,8,8,8,8,9],
//Луна
[1,2,2,2,3,4,4,5,6,6,7,8],[1,2,2,2,3,4,4,5,5,6,7,7,8,8,9],
//Неизвестная планета
[1,2,2,3,3,4,6,7,8],[2,2,3,3,3,4,4,4,4,4,4,4,5,5,6,6,6,7,7,8,8,8,9,9,9,9,10]
];

    //Разрушимые блоки координата X
var BreakableX=[
//Лаборатория
[5],[4],
//Поле боя
[],[],[],
//Шахта
[2],[4,2],[2,5,2],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[2],[5,1,4],[2,1,7,4],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Разрушимые блоки координата Y
var BreakableY=[
//Лаборатория
[2],[2],
//Поле боя
[],[],[],
//Шахта
[4],[3,7],[3,5,7],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[1],[2,4,7],[1,4,4,7],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Объекты для взятия координата X
var TakeX =[
//Лаборатория
[],[],
//Поле боя
[2],[7,4],[3,6,4],
//Шахта
[1],[4,1],[3,6,1],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[1],
//Огород
[],[3,1],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[7,7],[7,9,8],
//Луна
[7,3,5,2],[1,7,3,9,5,1,5],
//Неизвестная планета
[1,4,10,7,2],[9]
];
    //Объекты для взятия координата Y
var TakeY =[
//Лаборатория
[],[],
//Поле боя
[6],[2,7],[3,2,6],
//Шахта
[4],[2,7],[3,5,7],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[5],
//Огород
[],[7,8],[2,5,9],
//Пустыня
[],[],[],
//Дом со скелетами
[],[1,2],[2,5,9],
//Луна
[1,2,6,8],[1,1,2,2,5,6,9],
//Неизвестная планета
[1,1,5,8,9],[2]
];

    //Места кладки координата X
var PutX =[
//Лаборатория
[],[],
//Поле боя
[7],[7,7],[7,7,7],
//Шахта
[4],[4,4],[4,4,4],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[7],
//Огород
[],[4,7],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[9,9,9,9],[9,9,9,9,9,9,9],
//Неизвестная планета
[6,7,8,9,10],[10]
];
    //Места кладки координата Y
var PutY =[
//Лаборатория
[],[],
//Поле боя
[7],[6,7],[5,6,7],
//Шахта
[7],[6,7],[5,6,7],
//Пиратский корабль
[],[4,7],[],
//Пещеры гоблинов
[],[],[1],
//Огород
[],[2,7],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[6,7,8,9],[3,4,5,6,7,8,9],
//Неизвестная планета
[1,1,1,1,1],[10]
];

    //Бомбы координата X
var BombsX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[5,1,5],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Бомбы координата Y
var BombsY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[2,5,6],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Противники координата X
var EnemiesX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[5,2,7],[5,3,7],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[4,1,9,3,7,2,8,10,1,4,6,9],[1,1,7,6,7,5]
];
    //Противники координата Y
var EnemiesY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[1,2,7],[1,7,7],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[3,4,4,5,5,7,7,7,8,10,10,10],[1,3,3,4,5,9]
];

    //Cлабые противники координата X
var PowFoesX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[5],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Cлабые противники координата Y
var PowFoesY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[4],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Средние противники координата X
var MedFoesX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[3,5],[5,6,5],[1,5,3,6],
//Огород
[],[],[],
//Пустыня
[],[],[5,8,1,3,8],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Средние противники координата Y
var MedFoesY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[1,7],[1,6,7],[1,1,5,6],
//Огород
[],[],[],
//Пустыня
[],[],[1,1,2,7,8],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Двери координата X
var DoorsX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[0],[0],[0],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Двери координата Y
var DoorsY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[4],[4],[4],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Грядки координата X
var PlantsX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[2,2],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Грядки координата Y
var PlantsY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[6,8],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Растения координата X
var ToPlantX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[8,3],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Растения координата Y
var ToPlantY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[1,3],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Грядки заполненные координата X
var PlantedX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[2,3,4,2,3,4],[2,3,4,5,6,7,2,3,4,5,6,7],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Грядки заполненные координата Y
var PlantedY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[6,6,6,8,8,8],[6,6,6,6,6,6,8,8,8,8,8,8],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Неподвижные противники координата X
var Targets1X=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[3,5,2,5,1,1,3,7],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Неподвижные противники координата Y
var Targets1Y=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[1,1,3,3,5,7,7,7],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Ремонт координата X
var RepairX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[2],[2,5,2],[2,5],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Ремонт координата Y
var RepairY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[6],[1,5,6],[4,5],
//Дом со скелетами
[],[],[],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Авто-двери координата X
var DoorsAX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[0],[0],[0],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Авто-двери координата Y
var DoorsAY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[5],[5],[5],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Рычаги координата X
var PullAX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[5],[9],[9],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Рычаги координата Y
var PullAY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[8],[8],[8],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Место для кладки и езды координата X
var PutAX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[1,5],[1,3,3,5],
//Луна
[],[],
//Неизвестная планета
[],[]
];
    //Место для кладки и езды координата Y
var PutAY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[3,5],[2,3,6,9],
//Луна
[],[],
//Неизвестная планета
[],[]
];

    //Зоны поражения координата X
var DangerX=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[4,2,5],
//Неизвестная планета
[],[]
];
    //Зоны поражения координата Y
var DangerY=[
//Лаборатория
[],[],
//Поле боя
[],[],[],
//Шахта
[],[],[],
//Пиратский корабль
[],[],[],
//Пещеры гоблинов
[],[],[],
//Огород
[],[],[],
//Пустыня
[],[],[],
//Дом со скелетами
[],[],[],
//Луна
[],[2,3,6],
//Неизвестная планета
[],[]
];